tap "caskroom/cask"
tap "heroku/brew"

brew "mas"

mas "Xcode", id: 497799835
mas "iVinci", id: 566518298 

# Basic dev
brew "openssl"
brew "git"
brew "tree"
brew "htop"
brew "heroku/brew/heroku"
brew "pipenv"
brew "pandoc"
brew "pwgen"
brew "awscli"
# brew "cookiecutter"
brew "travis"
brew "autojump"

# Python interpreters
brew "python2"
brew "python3"
brew "pypy"
brew "pypy3"
brew "ipython"

# Node 8
brew "node@8"

# Backup
brew "mackup"
brew "wget"
brew "httpie"

# Databases
brew "postgresql"
brew "redis"

# Install bash utilities.
brew "bats"
brew "shellcheck"

# Virtualization
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"

# Dev & work
cask "pycharm"
cask "sublime-text"
cask "visual-studio-code"
cask "iterm2"
cask "insomnia"
cask "slack"
cask "gitter"
cask "limechat"
cask "redis-app"

# File exchange
cask "dropbox"
cask "hubic"
cask "megasync"

# Various
cask "1password"
cask "google-chrome"
cask "firefox"
cask "skype"
cask "whatsapp"
cask "spotify"
cask "vlc"
cask "cerebro"
cask "krita"
cask "grammarly"
cask "spectacle"
cask "the-unarchiver"
cask "licecap"
cask "gpg-suite"
cask "ipvanish-vpn"
