tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
# tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "github/gh"

brew "mas"

# mas "Xcode", id: 497799835
# mas "iVinci", id: 566518298 
# mas "GarageBand", id: 682658836
# mas "Keynote", id: 409183694
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
# mas "iMovie", id: 408981434
# mas "LimeChat", id: 414030210 

# Basic dev
brew "bash"
brew "openssl"
brew "git"
brew "gh"
brew "tree"
brew "htop"
brew "heroku/brew/heroku"
brew "pandoc"
brew "pwgen"
brew "awscli"
brew "cookiecutter"
brew "autojump"
brew "nvm"
brew "pipx"
brew "pyenv"
brew "ipython"
brew "jupyterlab"
brew "coreutils"
brew "wget"
brew "jq"
brew "rich-cli"
brew "go"
brew "ruby"
brew "wagoodman/dive/dive"
brew "withgraphite/tap/graphite"


# better unix tools
brew "httpie"
brew "duf"
brew "dust"
brew "ripgrep"

# Backup
brew "mackup"

# Databases
# brew "postgresql", restart_service: true
brew "redis"

# Install bash utilities.
brew "bats"
brew "shellcheck"

# Dev & work
cask "jetbrains-toolbox"
cask "visual-studio-code"
cask "iterm2"
cask "insomnia"
cask "insomnia-designer"
cask "slack"
cask "gitter"
# cask "redis-app"
cask "docker"
cask "figma"
# brew "terraform"
brew "gdal"
cask "go2shell"

# File exchange
cask "dropbox"

# Various
cask "1password"
cask "1password-cli"
cask "google-chrome"
cask "firefox"
cask "discord"
cask "whatsapp"
cask "spotify"
cask "vlc"
cask "krita"
cask "rectangle"
cask "the-unarchiver"
cask "licecap"
cask "gpg-suite"
cask "webtorrent"
cask "cryptomator"
cask "expressvpn"
cask "daisydisk"

# Fonts
cask "font-fira-mono-for-powerline"
cask "font-ubuntu-mono"
cask "font-jetbrains-mono"
cask "font-cascadia-mono"
cask "font-roboto-mono"
