tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

brew "mas"

mas "Xcode", id: 497799835
mas "iVinci", id: 566518298 
# mas "GarageBand", id: 682658836
# mas "Keynote", id: 409183694
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
# mas "iMovie", id: 408981434

# Basic dev
brew "openssl"
brew "git"
brew "tree"
brew "htop"
brew "heroku/brew/heroku"
brew "pipenv"
brew "pandoc"
brew "pwgen"
brew "awscli"
brew "cookiecutter"
brew "travis"
brew "autojump"
brew "node"
brew "nvm"
brew "pyenv"

# Backup
brew "mackup"
brew "wget"
brew "httpie"

# Databases
# brew "postgresql", restart_service: true
brew "redis"

# Install bash utilities.
brew "bats"
brew "shellcheck"

# Dev & work
cask "pycharm"
cask "visual-studio-code"
cask "iterm2"
cask "insomnia"
cask "slack"
cask "gitter"
cask "limechat"
cask "redis-app"
cask "docker"
cask "figma"
brew "exercism"
# brew "terraform"
brew "gdal"

# File exchange
cask "dropbox"
cask "hubic"

# Various
cask "1password"
cask "google-chrome"
cask "firefox"
cask "skype"
cask "whatsapp"
cask "spotify"
cask "vlc"
cask "cerebro"
cask "krita"
cask "grammarly"
cask "spectacle"
cask "the-unarchiver"
cask "licecap"
cask "gpg-suite"
cask "ipvanish-vpn"
cask "webtorrent"
